# Brewfile of August Guidry brew tap (uncomment below to use) tap 'homebrew/boneyard' tap 'homebrew/bundle' tap 'homebrew/cask'
# tap 'homebrew/cask-drivers'
# tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions'
# tap 'homebrew/core'
# tap 'homebrew/dev-tools'
# tap 'homebrew/services'

# "brew install [APP]"
brew 'aerc'
brew 'asdf'
brew 'bash'
brew 'buku'
brew 'calc'
brew 'circumflex'
brew 'clipboard'
brew 'cmus'
brew 'composer'
brew 'coreutils'
brew 'curl'
brew 'direnv'
brew 'docker'
brew 'docker-compose'
brew 'eza'
brew 'fastfetch'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gnu-chess'
brew 'gpg'
brew 'groff'
brew 'himalaya'
brew 'htop'
brew 'hugo'
brew 'irssi'
brew 'ispell'
brew 'isync'
brew 'khal'
brew 'khard'
brew 'lazygit'
brew 'lf'
brew 'lighttpd'
brew 'livetex'
brew 'llm'
brew 'lynx'
brew 'mackup'
brew 'mas'
brew 'msmtp'
brew 'neomutt'
brew 'neovim'
brew 'newsboat'
brew 'notmuch'
brew 'pandoc'
brew 'pass'
brew 'pass-otp'
brew 'peco'
brew 'prettier'
brew 'proselint'
brew 'qemu'
brew 'remind'
brew 'ripgrep'
brew 'ripmime'
brew 'sc-im'
brew 'shellcheck'
brew 'speedread'
brew 'speedtest-cli'
brew 'sqlite'
brew 'stow'
brew 'syncthing'
brew 'telnet'
brew 'thefuck'
brew 'tldr'
brew 'tmux'
brew 'tpm'
brew 'tree'
brew 'urlscan'
brew 'urlview'
brew 'vdirsyncer'
brew 'viu'
brew 'w3m'
brew 'webp'
brew 'wget'
brew 'whalebrew'
brew 'wifi-password'
brew 'xdg-ninja'
brew 'yadm'
brew 'yt-dlp'
brew 'z'
brew 'zoxide'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# "brew install --cask [APP]"
cask 'alacritty'
cask 'anki'
cask 'appcleaner'
cask 'balenaetcher'
cask 'blender'
cask 'calibre'
cask 'customshortcuts'
cask 'cyberduck'
cask 'gpg-suite'
cask 'jiggler'
cask 'keyclu'
cask 'krita'
cask 'libreoffice'
cask 'librewolf', args: { no_quarantine: true }
cask 'love'
cask 'mpv'
cask 'musicbrainz-picard'
cask 'obs'
cask 'onedrive'
cask 'onyx'
cask 'openemu'
cask 'soulseek'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'tunnelblick'
cask 'wacom-tablet'

# "mas install [APP]"
mas 'Xcode', id: 1419729466
mas 'Final Cut Pro', id: 424389933
mas 'Logic Pro', id: 634148309

# "whalebrew install [APP]"
# example: whalebrew 'whalebrew/wget'

# "vscode --install-extension [EXTENSION]"
# example: vscode "GitHub.codespaces"
